examples/docker_executor/experiments/exp1_backend_comparison/dockerbe_full_shm/5_host_dockerbe_tp1_bench.txt
WARNING 03-18 10:30:59 [cuda.py:636] Detected different devices in the system: NVIDIA A30, NVIDIA A100-PCIE-40GB, NVIDIA A100-PCIE-40GB. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fd7b7b9dc60>, trust_remote_code=False, seed=0, num_prompts=500, dataset_name='sharegpt', no_stream=False, dataset_path='/home/thd/repositories/vllm-dev/vllm-source/examples/docker_executor/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=10.0, burstiness=1.0, disable_tqdm=False, num_warmups=3, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-f062451d-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 3 requests...
100%|██████████| 3/3 [00:01<00:00,  1.64it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 500/500 [00:55<00:00,  9.01it/s]
Failed requests during benchmark run detected (capping to 10):
Error 0: Bad Request
Error 1: Bad Request
Error 2: Bad Request
Error 3: Bad Request
Error 4: Bad Request
Error 5: Bad Request
Error 6: Bad Request
Error 7: Bad Request
Error 8: Bad Request
Error 9: Bad Request
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     352       
Failed requests:                         148       
Request rate configured (RPS):           10.00     
Benchmark duration (s):                  55.51     
Total input tokens:                      42932     
Total generated tokens:                  56502     
Request throughput (req/s):              6.34      
Output token throughput (tok/s):         1017.94   
Peak output token throughput (tok/s):    2654.00   
Peak concurrent requests:                66.00     
Total token throughput (tok/s):          1791.41   
---------------Time to First Token----------------
Mean TTFT (ms):                          546.02    
Median TTFT (ms):                        49.81     
P99 TTFT (ms):                           6653.62   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.86     
Median TPOT (ms):                        15.34     
P99 TPOT (ms):                           92.93     
---------------Inter-token Latency----------------
Mean ITL (ms):                           16.39     
Median ITL (ms):                         14.65     
P99 ITL (ms):                            38.65     
==================================================